chengping1970/STM8S207/Mhlrx_reg.h
///*****************************************
//  Copyright (C) 2009-2014
//  ITE Tech. Inc. All Rights Reserved
//  Proprietary and Confidential
///*****************************************
//   @file   <Mhlrx_reg.h>
//   @author Max.Kao@ite.com.tw
//   @date   2013/06/04
//   @fileversion: ITE_IT6802_SAMPLE_V0.95
//******************************************/
#ifndef _HDMIRX_REG_H_
#define _HDMIRX_REG_H_

#if 1
/*****************************************************************************/
/* Register Definitions ******************************************************/
/*****************************************************************************/
#define REG_RX_000 0x00 // REG_RX_000
#define REG_RX_001 0x01 // REG_RX_001
#define REG_RX_002 0x02 // REG_RX_002
#define REG_RX_003 0x03 // REG_RX_003
#define REG_RX_004 0x04 // REG_RX_004
#define REG_RX_005 0x05 // REG_RX_005
#define REG_RX_006 0x06 // REG_RX_006
#define REG_RX_007 0x07 // REG_RX_007
#define REG_RX_008 0x08 // REG_RX_008
#define REG_RX_009 0x09 // REG_RX_009
#define REG_RX_00A 0x0A // REG_RX_00A
#define REG_RX_00B 0x0B // REG_RX_00B
#define REG_RX_00C 0x0C // REG_RX_00C
#define REG_RX_00D 0x0D // REG_RX_00D
#define REG_RX_00E 0x0E // REG_RX_00E
#define REG_RX_00F 0x0F // REG_RX_00F
#define REG_RX_010 0x10 // REG_RX_010
#define REG_RX_011 0x11 // REG_RX_011
#define REG_RX_012 0x12 // REG_RX_012
#define REG_RX_013 0x13 // REG_RX_013
#define REG_RX_014 0x14 // REG_RX_014
#define REG_RX_015 0x15 // REG_RX_015
#define REG_RX_016 0x16 // REG_RX_016
#define REG_RX_017 0x17 // REG_RX_017
#define REG_RX_018 0x18 // REG_RX_018
#define REG_RX_019 0x19 // REG_RX_019
#define REG_RX_01A 0x1A // REG_RX_01A
#define REG_RX_01B 0x1B // REG_RX_01B
#define REG_RX_01C 0x1C // REG_RX_01C
#define REG_RX_01D 0x1D // REG_RX_01D
#define REG_RX_01E 0x1E // REG_RX_01E
#define REG_RX_01F 0x1F // REG_RX_01F
#define REG_RX_020 0x20 // REG_RX_020
#define REG_RX_021 0x21 // REG_RX_021
#define REG_RX_022 0x22 // REG_RX_022
#define REG_RX_023 0x23 // REG_RX_023
#define REG_RX_024 0x24 // REG_RX_024
#define REG_RX_025 0x25 // REG_RX_025
#define REG_RX_026 0x26 // REG_RX_026
#define REG_RX_027 0x27 // REG_RX_027
#define REG_RX_028 0x28 // REG_RX_028
#define REG_RX_029 0x29 // REG_RX_029
#define REG_RX_02A 0x2A // REG_RX_02A
#define REG_RX_02B 0x2B // REG_RX_02B
#define REG_RX_02C 0x2C // REG_RX_02C
#define REG_RX_02D 0x2D // REG_RX_02D
#define REG_RX_02E 0x2E // REG_RX_02E
#define REG_RX_02F 0x2F // REG_RX_02F
#define REG_RX_030 0x30 // REG_RX_030
#define REG_RX_031 0x31 // REG_RX_031
#define REG_RX_032 0x32 // REG_RX_032
#define REG_RX_033 0x33 // REG_RX_033
#define REG_RX_034 0x34 // REG_RX_034
#define REG_RX_035 0x35 // REG_RX_035
#define REG_RX_036 0x36 // REG_RX_036
#define REG_RX_037 0x37 // REG_RX_037
#define REG_RX_038 0x38 // REG_RX_038
#define REG_RX_039 0x39 // REG_RX_039
#define REG_RX_03A 0x3A // REG_RX_03A
#define REG_RX_03B 0x3B // REG_RX_03B
#define REG_RX_03C 0x3C // REG_RX_03C
#define REG_RX_03D 0x3D // REG_RX_03D
#define REG_RX_03E 0x3E // REG_RX_03E
#define REG_RX_03F 0x3F // REG_RX_03F
#define REG_RX_040 0x40 // REG_RX_040
#define REG_RX_041 0x41 // REG_RX_041
#define REG_RX_042 0x42 // REG_RX_042
#define REG_RX_043 0x43 // REG_RX_043
#define REG_RX_044 0x44 // REG_RX_044
#define REG_RX_045 0x45 // REG_RX_045
#define REG_RX_046 0x46 // REG_RX_046
#define REG_RX_047 0x47 // REG_RX_047
#define REG_RX_048 0x48 // REG_RX_048
#define REG_RX_049 0x49 // REG_RX_049
#define REG_RX_04A 0x4A // REG_RX_04A
#define REG_RX_04B 0x4B // REG_RX_04B
#define REG_RX_04C 0x4C // REG_RX_04C
#define REG_RX_04D 0x4D // REG_RX_04D
#define REG_RX_04E 0x4E // REG_RX_04E
#define REG_RX_04F 0x4F // REG_RX_04F
#define REG_RX_050 0x50 // REG_RX_050
#define REG_RX_051 0x51 // REG_RX_051
#define REG_RX_052 0x52 // REG_RX_052
#define REG_RX_053 0x53 // REG_RX_053
#define REG_RX_054 0x54 // REG_RX_054
#define REG_RX_055 0x55 // REG_RX_055
#define REG_RX_056 0x56 // REG_RX_056
#define REG_RX_057 0x57 // REG_RX_057
#define REG_RX_058 0x58 // REG_RX_058
#define REG_RX_059 0x59 // REG_RX_059
#define REG_RX_05A 0x5A // REG_RX_05A
#define REG_RX_05B 0x5B // REG_RX_05B
#define REG_RX_05C 0x5C // REG_RX_05C
#define REG_RX_05D 0x5D // REG_RX_05D
#define REG_RX_05E 0x5E // REG_RX_05E
#define REG_RX_05F 0x5F // REG_RX_05F
#define REG_RX_060 0x60 // REG_RX_060
#define REG_RX_061 0x61 // REG_RX_061
#define REG_RX_062 0x62 // REG_RX_062
#define REG_RX_063 0x63 // REG_RX_063
#define REG_RX_064 0x64 // REG_RX_064
#define REG_RX_065 0x65 // REG_RX_065
#define REG_RX_066 0x66 // REG_RX_066
#define REG_RX_067 0x67 // REG_RX_067
#define REG_RX_068 0x68 // REG_RX_068
#define REG_RX_069 0x69 // REG_RX_069
#define REG_RX_06A 0x6A // REG_RX_06A
#define REG_RX_06B 0x6B // REG_RX_06B
#define REG_RX_06C 0x6C // REG_RX_06C
#define REG_RX_06D 0x6D // REG_RX_06D
#define REG_RX_06E 0x6E // REG_RX_06E
#define REG_RX_06F 0x6F // REG_RX_06F
#define REG_RX_070 0x70 // REG_RX_070
#define REG_RX_071 0x71 // REG_RX_071
#define REG_RX_072 0x72 // REG_RX_072
#define REG_RX_073 0x73 // REG_RX_073
#define REG_RX_074 0x74 // REG_RX_074
#define REG_RX_075 0x75 // REG_RX_075
#define REG_RX_076 0x76 // REG_RX_076
#define REG_RX_077 0x77 // REG_RX_077
#define REG_RX_078 0x78 // REG_RX_078
#define REG_RX_079 0x79 // REG_RX_079
#define REG_RX_07A 0x7A // REG_RX_07A
#define REG_RX_07B 0x7B // REG_RX_07B
#define REG_RX_07C 0x7C // REG_RX_07C
#define REG_RX_07D 0x7D // REG_RX_07D
#define REG_RX_07E 0x7E // REG_RX_07E
#define REG_RX_07F 0x7F // REG_RX_07F
#define REG_RX_080 0x80 // REG_RX_080
#define REG_RX_081 0x81 // REG_RX_081
#define REG_RX_082 0x82 // REG_RX_082
#define REG_RX_083 0x83 // REG_RX_083
#define REG_RX_084 0x84 // REG_RX_084
#define REG_RX_085 0x85 // REG_RX_085
#define REG_RX_086 0x86 // REG_RX_086
#define REG_RX_087 0x87 // REG_RX_087
#define REG_RX_088 0x88 // REG_RX_088
#define REG_RX_089 0x89 // REG_RX_089
#define REG_RX_08A 0x8A // REG_RX_08A
#define REG_RX_08B 0x8B // REG_RX_08B
#define REG_RX_08C 0x8C // REG_RX_08C
#define REG_RX_08D 0x8D // REG_RX_08D
#define REG_RX_08E 0x8E // REG_RX_08E
#define REG_RX_08F 0x8F // REG_RX_08F
#define REG_RX_090 0x90 // REG_RX_090
#define REG_RX_091 0x91 // REG_RX_091
#define REG_RX_092 0x92 // REG_RX_092
#define REG_RX_093 0x93 // REG_RX_093
#define REG_RX_094 0x94 // REG_RX_094
#define REG_RX_095 0x95 // REG_RX_095
#define REG_RX_096 0x96 // REG_RX_096
#define REG_RX_097 0x97 // REG_RX_097
#define REG_RX_098 0x98 // REG_RX_098
#define REG_RX_099 0x99 // REG_RX_099
#define REG_RX_09A 0x9A // REG_RX_09A
#define REG_RX_09B 0x9B // REG_RX_09B
#define REG_RX_09C 0x9C // REG_RX_09C
#define REG_RX_09D 0x9D // REG_RX_09D
#define REG_RX_09E 0x9E // REG_RX_09E
#define REG_RX_09F 0x9F // REG_RX_09F
#define REG_RX_0A0 0xA0 // REG_RX_0A0
#define REG_RX_0A1 0xA1 // REG_RX_0A1
#define REG_RX_0A2 0xA2 // REG_RX_0A2
#define REG_RX_0A3 0xA3 // REG_RX_0A3
#define REG_RX_0A4 0xA4 // REG_RX_0A4
#define REG_RX_0A5 0xA5 // REG_RX_0A5
#define REG_RX_0A6 0xA6 // REG_RX_0A6
#define REG_RX_0A7 0xA7 // REG_RX_0A7
#define REG_RX_0A8 0xA8 // REG_RX_0A8
#define REG_RX_0A9 0xA9 // REG_RX_0A9
#define REG_RX_0AA 0xAA // REG_RX_0AA
#define REG_RX_0AB 0xAB // REG_RX_0AB
#define REG_RX_0AC 0xAC // REG_RX_0AC
#define REG_RX_0AD 0xAD // REG_RX_0AD
#define REG_RX_0AE 0xAE // REG_RX_0AE
#define REG_RX_0AF 0xAF // REG_RX_0AF
#define REG_RX_0BA 0xBA // REG_RX_0BA
#define REG_RX_0BB 0xBB // REG_RX_0BB
#define REG_RX_0BC 0xBC // REG_RX_0BC
#define REG_RX_0BD 0xBD // REG_RX_0BD
#define REG_RX_0BE 0xBE // REG_RX_0BE
#define REG_RX_0BF 0xBF // REG_RX_0BF
#define REG_RX_0B0 0xB0 // REG_RX_0B0
#define REG_RX_0B1 0xB1 // REG_RX_0B1
#define REG_RX_0B2 0xB2 // REG_RX_0B2
#define REG_RX_0B3 0xB3 // REG_RX_0B3
#define REG_RX_0B4 0xB4 // REG_RX_0B4
#define REG_RX_0B5 0xB5 // REG_RX_0B5
#define REG_RX_0B6 0xB6 // REG_RX_0B6
#define REG_RX_0B7 0xB7 // REG_RX_0B7
#define REG_RX_0B8 0xB8 // REG_RX_0B8
#define REG_RX_0B9 0xB9 // REG_RX_0B9
#define REG_RX_0BA 0xBA // REG_RX_0BA
#define REG_RX_0BB 0xBB // REG_RX_0BB
#define REG_RX_0BC 0xBC // REG_RX_0BC
#define REG_RX_0BD 0xBD // REG_RX_0BD
#define REG_RX_0BE 0xBE // REG_RX_0BE
#define REG_RX_0BF 0xBF // REG_RX_0BF
#define REG_RX_0BA 0xBA // REG_RX_0BA
#define REG_RX_0BB 0xBB // REG_RX_0BB
#define REG_RX_0BC 0xBC // REG_RX_0BC
#define REG_RX_0BD 0xBD // REG_RX_0BD
#define REG_RX_0BE 0xBE // REG_RX_0BE
#define REG_RX_0BF 0xBF // REG_RX_0BF
#define REG_RX_0C0 0xC0 // REG_RX_0C0
#define REG_RX_0C1 0xC1 // REG_RX_0C1
#define REG_RX_0C2 0xC2 // REG_RX_0C2
#define REG_RX_0C3 0xC3 // REG_RX_0C3
#define REG_RX_0C4 0xC4 // REG_RX_0C4
#define REG_RX_0C5 0xC5 // REG_RX_0C5
#define REG_RX_0C6 0xC6 // REG_RX_0C6
#define REG_RX_0C7 0xC7 // REG_RX_0C7
#define REG_RX_0C8 0xC8 // REG_RX_0C8
#define REG_RX_0C9 0xC9 // REG_RX_0C9
#define REG_RX_0CA 0xCA // REG_RX_0CA
#define REG_RX_0CB 0xCB // REG_RX_0CB
#define REG_RX_0CC 0xCC // REG_RX_0CC
#define REG_RX_0CD 0xCD // REG_RX_0CD
#define REG_RX_0CE 0xCE // REG_RX_0CE
#define REG_RX_0CF 0xCF // REG_RX_0CF
#define REG_RX_0CA 0xCA // REG_RX_0CA
#define REG_RX_0CB 0xCB // REG_RX_0CB
#define REG_RX_0CC 0xCC // REG_RX_0CC
#define REG_RX_0CD 0xCD // REG_RX_0CD
#define REG_RX_0CE 0xCE // REG_RX_0CE
#define REG_RX_0CF 0xCF // REG_RX_0CF
#define REG_RX_0D0 0xD0 // REG_RX_0D0
#define REG_RX_0D1 0xD1 // REG_RX_0D1
#define REG_RX_0D2 0xD2 // REG_RX_0D2
#define REG_RX_0D3 0xD3 // REG_RX_0D3
#define REG_RX_0D4 0xD4 // REG_RX_0D4
#define REG_RX_0D5 0xD5 // REG_RX_0D5
#define REG_RX_0D6 0xD6 // REG_RX_0D6
#define REG_RX_0D7 0xD7 // REG_RX_0D7
#define REG_RX_0D8 0xD8 // REG_RX_0D8
#define REG_RX_0D9 0xD9 // REG_RX_0D9
#define REG_RX_0DA 0xDA // REG_RX_0DA
#define REG_RX_0DB 0xDB // REG_RX_0DB
#define REG_RX_0DC 0xDC // REG_RX_0DC
#define REG_RX_0DD 0xDD // REG_RX_0DD
#define REG_RX_0DE 0xDE // REG_RX_0DE
#define REG_RX_0DF 0xDF // REG_RX_0DF
#define REG_RX_0DA 0xDA // REG_RX_0DA
#define REG_RX_0DB 0xDB // REG_RX_0DB
#define REG_RX_0DC 0xDC // REG_RX_0DC
#define REG_RX_0DD 0xDD // REG_RX_0DD
#define REG_RX_0DE 0xDE // REG_RX_0DE
#define REG_RX_0DF 0xDF // REG_RX_0DF
#define REG_RX_0E0 0xE0 // REG_RX_0E0
#define REG_RX_0E1 0xE1 // REG_RX_0E1
#define REG_RX_0E2 0xE2 // REG_RX_0E2
#define REG_RX_0E3 0xE3 // REG_RX_0E3
#define REG_RX_0E4 0xE4 // REG_RX_0E4
#define REG_RX_0E5 0xE5 // REG_RX_0E5
#define REG_RX_0E6 0xE6 // REG_RX_0E6
#define REG_RX_0E7 0xE7 // REG_RX_0E7
#define REG_RX_0E8 0xE8 // REG_RX_0E8
#define REG_RX_0E9 0xE9 // REG_RX_0E9
#define REG_RX_0EA 0xEA // REG_RX_0EA
#define REG_RX_0EB 0xEB // REG_RX_0EB
#define REG_RX_0EC 0xEC // REG_RX_0EC
#define REG_RX_0ED 0xED // REG_RX_0ED
#define REG_RX_0EE 0xEE // REG_RX_0EE
#define REG_RX_0EF 0xEF // REG_RX_0EF
#define REG_RX_0EA 0xEA // REG_RX_0EA
#define REG_RX_0EB 0xEB // REG_RX_0EB
#define REG_RX_0EC 0xEC // REG_RX_0EC
#define REG_RX_0ED 0xED // REG_RX_0ED
#define REG_RX_0EE 0xEE // REG_RX_0EE
#define REG_RX_0EF 0xEF // REG_RX_0EF
#define REG_RX_0F0 0xF0 // REG_RX_0F0
#define REG_RX_0F1 0xF1 // REG_RX_0F1
#define REG_RX_0F2 0xF2 // REG_RX_0F2
#define REG_RX_0F3 0xF3 // REG_RX_0F3
#define REG_RX_0F4 0xF4 // REG_RX_0F4
#define REG_RX_0F5 0xF5 // REG_RX_0F5
#define REG_RX_0F6 0xF6 // REG_RX_0F6
#define REG_RX_0F7 0xF7 // REG_RX_0F7
#define REG_RX_0F8 0xF8 // REG_RX_0F8
#define REG_RX_0F9 0xF9 // REG_RX_0F9
#define REG_RX_0FA 0xFA // REG_RX_0FA
#define REG_RX_0FB 0xFB // REG_RX_0FB
#define REG_RX_0FC 0xFC // REG_RX_0FC
#define REG_RX_0FD 0xFD // REG_RX_0FD
#define REG_RX_0FE 0xFE // REG_RX_0FE
#define REG_RX_0FF 0xFF // REG_RX_0FF
#define REG_RX_0FA 0xFA // REG_RX_0FA
#define REG_RX_0FB 0xFB // REG_RX_0FB
#define REG_RX_0FC 0xFC // REG_RX_0FC
#define REG_RX_0FD 0xFD // REG_RX_0FD
#define REG_RX_0FE 0xFE // REG_RX_0FE
#define REG_RX_0FF 0xFF // REG_RX_0FF
                        //
#define REG_RX_100 0x00 // REG_RX_100
#define REG_RX_101 0x01 // REG_RX_101
#define REG_RX_102 0x02 // REG_RX_102
#define REG_RX_103 0x03 // REG_RX_103
#define REG_RX_104 0x04 // REG_RX_104
#define REG_RX_105 0x05 // REG_RX_105
#define REG_RX_106 0x06 // REG_RX_106
#define REG_RX_107 0x07 // REG_RX_107
#define REG_RX_108 0x08 // REG_RX_108
#define REG_RX_109 0x09 // REG_RX_109
#define REG_RX_10A 0x0A // REG_RX_10A
#define REG_RX_10B 0x0B // REG_RX_10B
#define REG_RX_10C 0x0C // REG_RX_10C
#define REG_RX_10D 0x0D // REG_RX_10D
#define REG_RX_10E 0x0E // REG_RX_10E
#define REG_RX_10F 0x0F // REG_RX_10F
#define REG_RX_110 0x10 // REG_RX_110
#define REG_RX_111 0x11 // REG_RX_111
#define REG_RX_112 0x12 // REG_RX_112
#define REG_RX_113 0x13 // REG_RX_113
#define REG_RX_114 0x14 // REG_RX_114
#define REG_RX_115 0x15 // REG_RX_115
#define REG_RX_116 0x16 // REG_RX_116
#define REG_RX_117 0x17 // REG_RX_117
#define REG_RX_118 0x18 // REG_RX_118
#define REG_RX_119 0x19 // REG_RX_119
#define REG_RX_11A 0x1A // REG_RX_11A
#define REG_RX_11B 0x1B // REG_RX_11B
#define REG_RX_11C 0x1C // REG_RX_11C
#define REG_RX_11D 0x1D // REG_RX_11D
#define REG_RX_11E 0x1E // REG_RX_11E
#define REG_RX_11F 0x1F // REG_RX_11F
#define REG_RX_120 0x20 // REG_RX_120
#define REG_RX_121 0x21 // REG_RX_121
#define REG_RX_122 0x22 // REG_RX_122
#define REG_RX_123 0x23 // REG_RX_123
#define REG_RX_124 0x24 // REG_RX_124
#define REG_RX_125 0x25 // REG_RX_125
#define REG_RX_126 0x26 // REG_RX_126
#define REG_RX_127 0x27 // REG_RX_127
#define REG_RX_128 0x28 // REG_RX_128
#define REG_RX_129 0x29 // REG_RX_129
#define REG_RX_12A 0x2A // REG_RX_12A
#define REG_RX_12B 0x2B // REG_RX_12B
#define REG_RX_12C 0x2C // REG_RX_12C
#define REG_RX_12D 0x2D // REG_RX_12D
#define REG_RX_12E 0x2E // REG_RX_12E
#define REG_RX_12F 0x2F // REG_RX_12F
#define REG_RX_130 0x30 // REG_RX_130
#define REG_RX_131 0x31 // REG_RX_131
#define REG_RX_132 0x32 // REG_RX_132
#define REG_RX_133 0x33 // REG_RX_133
#define REG_RX_134 0x34 // REG_RX_134
#define REG_RX_135 0x35 // REG_RX_135
#define REG_RX_136 0x36 // REG_RX_136
#define REG_RX_137 0x37 // REG_RX_137
#define REG_RX_138 0x38 // REG_RX_138
#define REG_RX_139 0x39 // REG_RX_139
#define REG_RX_13A 0x3A // REG_RX_13A
#define REG_RX_13B 0x3B // REG_RX_13B
#define REG_RX_13C 0x3C // REG_RX_13C
#define REG_RX_13D 0x3D // REG_RX_13D
#define REG_RX_13E 0x3E // REG_RX_13E
#define REG_RX_13F 0x3F // REG_RX_13F
#define REG_RX_140 0x40 // REG_RX_140
#define REG_RX_141 0x41 // REG_RX_141
#define REG_RX_142 0x42 // REG_RX_142
#define REG_RX_143 0x43 // REG_RX_143
#define REG_RX_144 0x44 // REG_RX_144
#define REG_RX_145 0x45 // REG_RX_145
#define REG_RX_146 0x46 // REG_RX_146
#define REG_RX_147 0x47 // REG_RX_147
#define REG_RX_148 0x48 // REG_RX_148
#define REG_RX_149 0x49 // REG_RX_149
#define REG_RX_14A 0x4A // REG_RX_14A
#define REG_RX_14B 0x4B // REG_RX_14B
#define REG_RX_14C 0x4C // REG_RX_14C
#define REG_RX_14D 0x4D // REG_RX_14D
#define REG_RX_14E 0x4E // REG_RX_14E
#define REG_RX_14F 0x4F // REG_RX_14F
#define REG_RX_150 0x50 // REG_RX_150
#define REG_RX_151 0x51 // REG_RX_151
#define REG_RX_152 0x52 // REG_RX_152
#define REG_RX_153 0x53 // REG_RX_153
#define REG_RX_154 0x54 // REG_RX_154
#define REG_RX_155 0x55 // REG_RX_155
#define REG_RX_156 0x56 // REG_RX_156
#define REG_RX_157 0x57 // REG_RX_157
#define REG_RX_158 0x58 // REG_RX_158
#define REG_RX_159 0x59 // REG_RX_159
#define REG_RX_15A 0x5A // REG_RX_15A
#define REG_RX_15B 0x5B // REG_RX_15B
#define REG_RX_15C 0x5C // REG_RX_15C
#define REG_RX_15D 0x5D // REG_RX_15D
#define REG_RX_15E 0x5E // REG_RX_15E
#define REG_RX_15F 0x5F // REG_RX_15F
#define REG_RX_160 0x60 // REG_RX_160
#define REG_RX_161 0x61 // REG_RX_161
#define REG_RX_162 0x62 // REG_RX_162
#define REG_RX_163 0x63 // REG_RX_163
#define REG_RX_164 0x64 // REG_RX_164
#define REG_RX_165 0x65 // REG_RX_165
#define REG_RX_166 0x66 // REG_RX_166
#define REG_RX_167 0x67 // REG_RX_167
#define REG_RX_168 0x68 // REG_RX_168
#define REG_RX_169 0x69 // REG_RX_169
#define REG_RX_16A 0x6A // REG_RX_16A
#define REG_RX_16B 0x6B // REG_RX_16B
#define REG_RX_16C 0x6C // REG_RX_16C
#define REG_RX_16D 0x6D // REG_RX_16D
#define REG_RX_16E 0x6E // REG_RX_16E
#define REG_RX_16F 0x6F // REG_RX_16F


