chengping1970/STM8S207/Mhlrx_reg.h
#define REG_RX_170 0x70 // REG_RX_170
#define REG_RX_171 0x71 // REG_RX_171
#define REG_RX_172 0x72 // REG_RX_172
#define REG_RX_173 0x73 // REG_RX_173
#define REG_RX_174 0x74 // REG_RX_174
#define REG_RX_175 0x75 // REG_RX_175
#define REG_RX_176 0x76 // REG_RX_176
#define REG_RX_177 0x77 // REG_RX_177
#define REG_RX_178 0x78 // REG_RX_178
#define REG_RX_179 0x79 // REG_RX_179
#define REG_RX_17A 0x7A // REG_RX_17A
#define REG_RX_17B 0x7B // REG_RX_17B
#define REG_RX_17C 0x7C // REG_RX_17C
#define REG_RX_17D 0x7D // REG_RX_17D
#define REG_RX_17E 0x7E // REG_RX_17E
#define REG_RX_17F 0x7F // REG_RX_17F
#define REG_RX_180 0x80 // REG_RX_180
#define REG_RX_181 0x81 // REG_RX_181
#define REG_RX_182 0x82 // REG_RX_182
#define REG_RX_183 0x83 // REG_RX_183
#define REG_RX_184 0x84 // REG_RX_184

#define REG_RX_185 0x85 // REG_RX_185
#define REG_RX_186 0x86 // REG_RX_186
#define REG_RX_187 0x87 // REG_RX_187
#define REG_RX_188 0x88 // REG_RX_188
#define REG_RX_189 0x89 // REG_RX_189
#define REG_RX_18A 0x8A // REG_RX_18A
#define REG_RX_18B 0x8B // REG_RX_18B
#define REG_RX_18C 0x8C // REG_RX_18C
#define REG_RX_18D 0x8D // REG_RX_18D
#define REG_RX_18E 0x8E // REG_RX_18E
#define REG_RX_18F 0x8F // REG_RX_18F
#define REG_RX_190 0x90 // REG_RX_190
#define REG_RX_191 0x91 // REG_RX_191
#define REG_RX_192 0x92 // REG_RX_192
#define REG_RX_193 0x93 // REG_RX_193
#define REG_RX_194 0x94 // REG_RX_194
#define REG_RX_195 0x95 // REG_RX_195
#define REG_RX_196 0x96 // REG_RX_196
#define REG_RX_197 0x97 // REG_RX_197
#define REG_RX_198 0x98 // REG_RX_198
#define REG_RX_199 0x99 // REG_RX_199
#define REG_RX_19A 0x9A // REG_RX_19A
#define REG_RX_19B 0x9B // REG_RX_19B
#define REG_RX_19C 0x9C // REG_RX_19C
#define REG_RX_19D 0x9D // REG_RX_19D
#define REG_RX_19E 0x9E // REG_RX_19E
#define REG_RX_19F 0x9F // REG_RX_19F
#define REG_RX_1A0 0xA0 // REG_RX_1A0
#define REG_RX_1A1 0xA1 // REG_RX_1A1
#define REG_RX_1A2 0xA2 // REG_RX_1A2
#define REG_RX_1A3 0xA3 // REG_RX_1A3
#define REG_RX_1A4 0xA4 // REG_RX_1A4
#define REG_RX_1A5 0xA5 // REG_RX_1A5
#define REG_RX_1A6 0xA6 // REG_RX_1A6
#define REG_RX_1A7 0xA7 // REG_RX_1A7
#define REG_RX_1A8 0xA8 // REG_RX_1A8
#define REG_RX_1A9 0xA9 // REG_RX_1A9
#define REG_RX_1AA 0xAA // REG_RX_1AA
#define REG_RX_1AB 0xAB // REG_RX_1AB
#define REG_RX_1AC 0xAC // REG_RX_1AC
#define REG_RX_1AD 0xAD // REG_RX_1AD
#define REG_RX_1AE 0xAE // REG_RX_1AE
#define REG_RX_1AF 0xAF // REG_RX_1AF
#define REG_RX_1BA 0xBA // REG_RX_1BA
#define REG_RX_1BB 0xBB // REG_RX_1BB
#define REG_RX_1BC 0xBC // REG_RX_1BC
#define REG_RX_1BD 0xBD // REG_RX_1BD
#define REG_RX_1BE 0xBE // REG_RX_1BE
#define REG_RX_1BF 0xBF // REG_RX_1BF
#define REG_RX_1B0 0xB0 // REG_RX_1B0
#define REG_RX_1B1 0xB1 // REG_RX_1B1
#define REG_RX_1B2 0xB2 // REG_RX_1B2
#define REG_RX_1B3 0xB3 // REG_RX_1B3
#define REG_RX_1B4 0xB4 // REG_RX_1B4
#define REG_RX_1B5 0xB5 // REG_RX_1B5
#define REG_RX_1B6 0xB6 // REG_RX_1B6
#define REG_RX_1B7 0xB7 // REG_RX_1B7
#define REG_RX_1B8 0xB8 // REG_RX_1B8
#define REG_RX_1B9 0xB9 // REG_RX_1B9
#define REG_RX_1BA 0xBA // REG_RX_1BA
#define REG_RX_1BB 0xBB // REG_RX_1BB
#define REG_RX_1BC 0xBC // REG_RX_1BC
#define REG_RX_1BD 0xBD // REG_RX_1BD
#define REG_RX_1BE 0xBE // REG_RX_1BE
#define REG_RX_1BF 0xBF // REG_RX_1BF
#define REG_RX_1BA 0xBA // REG_RX_1BA
#define REG_RX_1BB 0xBB // REG_RX_1BB
#define REG_RX_1BC 0xBC // REG_RX_1BC
#define REG_RX_1BD 0xBD // REG_RX_1BD
#define REG_RX_1BE 0xBE // REG_RX_1BE
#define REG_RX_1BF 0xBF // REG_RX_1BF
#define REG_RX_1C0 0xC0 // REG_RX_1C0
#define REG_RX_1C1 0xC1 // REG_RX_1C1
#define REG_RX_1C2 0xC2 // REG_RX_1C2
#define REG_RX_1C3 0xC3 // REG_RX_1C3
#define REG_RX_1C4 0xC4 // REG_RX_1C4
#define REG_RX_1C5 0xC5 // REG_RX_1C5
#define REG_RX_1C6 0xC6 // REG_RX_1C6
#define REG_RX_1C7 0xC7 // REG_RX_1C7
#define REG_RX_1C8 0xC8 // REG_RX_1C8
#define REG_RX_1C9 0xC9 // REG_RX_1C9
#define REG_RX_1CA 0xCA // REG_RX_1CA
#define REG_RX_1CB 0xCB // REG_RX_1CB
#define REG_RX_1CC 0xCC // REG_RX_1CC
#define REG_RX_1CD 0xCD // REG_RX_1CD
#define REG_RX_1CE 0xCE // REG_RX_1CE
#define REG_RX_1CF 0xCF // REG_RX_1CF
#define REG_RX_1CA 0xCA // REG_RX_1CA
#define REG_RX_1CB 0xCB // REG_RX_1CB
#define REG_RX_1CC 0xCC // REG_RX_1CC
#define REG_RX_1CD 0xCD // REG_RX_1CD
#define REG_RX_1CE 0xCE // REG_RX_1CE
#define REG_RX_1CF 0xCF // REG_RX_1CF
#define REG_RX_1D0 0xD0 // REG_RX_1D0
#define REG_RX_1D1 0xD1 // REG_RX_1D1
#define REG_RX_1D2 0xD2 // REG_RX_1D2
#define REG_RX_1D3 0xD3 // REG_RX_1D3
#define REG_RX_1D4 0xD4 // REG_RX_1D4
#define REG_RX_1D5 0xD5 // REG_RX_1D5
#define REG_RX_1D6 0xD6 // REG_RX_1D6
#define REG_RX_1D7 0xD7 // REG_RX_1D7
#define REG_RX_1D8 0xD8 // REG_RX_1D8
#define REG_RX_1D9 0xD9 // REG_RX_1D9
#define REG_RX_1DA 0xDA // REG_RX_1DA
#define REG_RX_1DB 0xDB // REG_RX_1DB
#define REG_RX_1DC 0xDC // REG_RX_1DC
#define REG_RX_1DD 0xDD // REG_RX_1DD
#define REG_RX_1DE 0xDE // REG_RX_1DE
#define REG_RX_1DF 0xDF // REG_RX_1DF
#define REG_RX_1DA 0xDA // REG_RX_1DA
#define REG_RX_1DB 0xDB // REG_RX_1DB
#define REG_RX_1DC 0xDC // REG_RX_1DC
#define REG_RX_1DD 0xDD // REG_RX_1DD
#define REG_RX_1DE 0xDE // REG_RX_1DE
#define REG_RX_1DF 0xDF // REG_RX_1DF
#define REG_RX_1E0 0xE0 // REG_RX_1E0
#define REG_RX_1E1 0xE1 // REG_RX_1E1
#define REG_RX_1E2 0xE2 // REG_RX_1E2
#define REG_RX_1E3 0xE3 // REG_RX_1E3
#define REG_RX_1E4 0xE4 // REG_RX_1E4
#define REG_RX_1E5 0xE5 // REG_RX_1E5
#define REG_RX_1E6 0xE6 // REG_RX_1E6
#define REG_RX_1E7 0xE7 // REG_RX_1E7
#define REG_RX_1E8 0xE8 // REG_RX_1E8
#define REG_RX_1E9 0xE9 // REG_RX_1E9
#define REG_RX_1EA 0xEA // REG_RX_1EA
#define REG_RX_1EB 0xEB // REG_RX_1EB
#define REG_RX_1EC 0xEC // REG_RX_1EC
#define REG_RX_1ED 0xED // REG_RX_1ED
#define REG_RX_1EE 0xEE // REG_RX_1EE
#define REG_RX_1EF 0xEF // REG_RX_1EF
#define REG_RX_1EA 0xEA // REG_RX_1EA
#define REG_RX_1EB 0xEB // REG_RX_1EB
#define REG_RX_1EC 0xEC // REG_RX_1EC
#define REG_RX_1ED 0xED // REG_RX_1ED
#define REG_RX_1EE 0xEE // REG_RX_1EE
#define REG_RX_1EF 0xEF // REG_RX_1EF
#define REG_RX_1F0 0xF0 // REG_RX_1F0
#define REG_RX_1F1 0xF1 // REG_RX_1F1
#define REG_RX_1F2 0xF2 // REG_RX_1F2
#define REG_RX_1F3 0xF3 // REG_RX_1F3
#define REG_RX_1F4 0xF4 // REG_RX_1F4
#define REG_RX_1F5 0xF5 // REG_RX_1F5
#define REG_RX_1F6 0xF6 // REG_RX_1F6
#define REG_RX_1F7 0xF7 // REG_RX_1F7
#define REG_RX_1F8 0xF8 // REG_RX_1F8
#define REG_RX_1F9 0xF9 // REG_RX_1F9
#define REG_RX_1FA 0xFA // REG_RX_1FA
#define REG_RX_1FB 0xFB // REG_RX_1FB
#define REG_RX_1FC 0xFC // REG_RX_1FC
#define REG_RX_1FD 0xFD // REG_RX_1FD
#define REG_RX_1FE 0xFE // REG_RX_1FE
#define REG_RX_1FF 0xFF // REG_RX_1FF
#define REG_RX_1FA 0xFA // REG_RX_1FA
#define REG_RX_1FB 0xFB // REG_RX_1FB
#define REG_RX_1FC 0xFC // REG_RX_1FC
#define REG_RX_1FD 0xFD // REG_RX_1FD
#define REG_RX_1FE 0xFE // REG_RX_1FE
#define REG_RX_1FF 0xFF // REG_RX_1FF
                        //
#define REG_RX_200 0x00 // REG_RX_200
#define REG_RX_201 0x01 // REG_RX_201
#define REG_RX_202 0x02 // REG_RX_202
#define REG_RX_203 0x03 // REG_RX_203
#define REG_RX_204 0x04 // REG_RX_204
#define REG_RX_205 0x05 // REG_RX_205
#define REG_RX_206 0x06 // REG_RX_206
#define REG_RX_207 0x07 // REG_RX_207
#define REG_RX_208 0x08 // REG_RX_208
#define REG_RX_209 0x09 // REG_RX_209
#define REG_RX_20A 0x0A // REG_RX_20A
#define REG_RX_20B 0x0B // REG_RX_20B
#define REG_RX_20C 0x0C // REG_RX_20C
#define REG_RX_20D 0x0D // REG_RX_20D
#define REG_RX_20E 0x0E // REG_RX_20E
#define REG_RX_20F 0x0F // REG_RX_20F
#define REG_RX_210 0x10 // REG_RX_210
#define REG_RX_211 0x11 // REG_RX_211
#define REG_RX_212 0x12 // REG_RX_212
#define REG_RX_213 0x13 // REG_RX_213
#define REG_RX_214 0x14 // REG_RX_214
#define REG_RX_215 0x15 // REG_RX_215
#define REG_RX_215 0x15 // REG_RX_215
#define REG_RX_216 0x16 // REG_RX_216
#define REG_RX_217 0x17 // REG_RX_217
#define REG_RX_218 0x18 // REG_RX_218
#define REG_RX_219 0x19 // REG_RX_219
#define REG_RX_21A 0x1A // REG_RX_21A
#define REG_RX_21B 0x1B // REG_RX_21B
#define REG_RX_21C 0x1C // REG_RX_21C
#define REG_RX_21D 0x1D // REG_RX_21D
#define REG_RX_21E 0x1E // REG_RX_21E
#define REG_RX_21F 0x1F // REG_RX_21F
#define REG_RX_220 0x20 // REG_RX_220
#define REG_RX_221 0x21 // REG_RX_221
#define REG_RX_222 0x22 // REG_RX_222
#define REG_RX_223 0x23 // REG_RX_223
#define REG_RX_224 0x24 // REG_RX_224
#define REG_RX_225 0x25 // REG_RX_225
#define REG_RX_226 0x26 // REG_RX_226
#define REG_RX_227 0x27 // REG_RX_227
#define REG_RX_228 0x28 // REG_RX_228
#define REG_RX_229 0x29 // REG_RX_229
#define REG_RX_22A 0x2A // REG_RX_22A
#define REG_RX_22B 0x2B // REG_RX_22B
#define REG_RX_22C 0x2C // REG_RX_22C
#define REG_RX_22D 0x2D // REG_RX_22D
#define REG_RX_22E 0x2E // REG_RX_22E
#define REG_RX_22F 0x2F // REG_RX_22F
#define REG_RX_230 0x30 // REG_RX_230
#define REG_RX_231 0x31 // REG_RX_231
#define REG_RX_232 0x32 // REG_RX_232
#define REG_RX_233 0x33 // REG_RX_233
#define REG_RX_234 0x34 // REG_RX_234
#define REG_RX_235 0x35 // REG_RX_235
#define REG_RX_236 0x36 // REG_RX_236
#define REG_RX_237 0x37 // REG_RX_237
#define REG_RX_238 0x38 // REG_RX_238
#define REG_RX_239 0x39 // REG_RX_239
#define REG_RX_23A 0x3A // REG_RX_23A
#define REG_RX_23B 0x3B // REG_RX_23B
#define REG_RX_23C 0x3C // REG_RX_23C
#define REG_RX_23D 0x3D // REG_RX_23D
#define REG_RX_23E 0x3E // REG_RX_23E
#define REG_RX_23F 0x3F // REG_RX_23F
#define REG_RX_240 0x40 // REG_RX_240
#define REG_RX_241 0x41 // REG_RX_241
#define REG_RX_242 0x42 // REG_RX_242
#define REG_RX_243 0x43 // REG_RX_243
#define REG_RX_244 0x44 // REG_RX_244
#define REG_RX_245 0x45 // REG_RX_245
#define REG_RX_246 0x46 // REG_RX_246
#define REG_RX_247 0x47 // REG_RX_247
#define REG_RX_248 0x48 // REG_RX_248
#define REG_RX_249 0x49 // REG_RX_249
#define REG_RX_24A 0x4A // REG_RX_24A
#define REG_RX_24B 0x4B // REG_RX_24B
#define REG_RX_24C 0x4C // REG_RX_24C
#define REG_RX_24D 0x4D // REG_RX_24D
#define REG_RX_24E 0x4E // REG_RX_24E
#define REG_RX_24F 0x4F // REG_RX_24F
#define REG_RX_250 0x50 // REG_RX_250
#define REG_RX_251 0x51 // REG_RX_251
#define REG_RX_252 0x52 // REG_RX_252
#define REG_RX_253 0x53 // REG_RX_253
#define REG_RX_254 0x54 // REG_RX_254
#define REG_RX_255 0x55 // REG_RX_255
#define REG_RX_256 0x56 // REG_RX_256
#define REG_RX_257 0x57 // REG_RX_257
#define REG_RX_258 0x58 // REG_RX_258
#define REG_RX_259 0x59 // REG_RX_259
#define REG_RX_25A 0x5A // REG_RX_25A
#define REG_RX_25B 0x5B // REG_RX_25B
#define REG_RX_25C 0x5C // REG_RX_25C
#define REG_RX_25D 0x5D // REG_RX_25D
#define REG_RX_25E 0x5E // REG_RX_25E
#define REG_RX_25F 0x5F // REG_RX_25F
#define REG_RX_260 0x60 // REG_RX_260
#define REG_RX_261 0x61 // REG_RX_261
#define REG_RX_262 0x62 // REG_RX_262
#define REG_RX_263 0x63 // REG_RX_263
#define REG_RX_264 0x64 // REG_RX_264
#define REG_RX_265 0x65 // REG_RX_265
#define REG_RX_266 0x66 // REG_RX_266
#define REG_RX_267 0x67 // REG_RX_267
#define REG_RX_268 0x68 // REG_RX_268
#define REG_RX_269 0x69 // REG_RX_269
#define REG_RX_26A 0x6A // REG_RX_26A
#define REG_RX_26B 0x6B // REG_RX_26B
#define REG_RX_26C 0x6C // REG_RX_26C
#define REG_RX_26D 0x6D // REG_RX_26D
#define REG_RX_26E 0x6E // REG_RX_26E
#define REG_RX_26F 0x6F // REG_RX_26F
#define REG_RX_270 0x70 // REG_RX_270
#define REG_RX_271 0x71 // REG_RX_271
#define REG_RX_272 0x72 // REG_RX_272
#define REG_RX_273 0x73 // REG_RX_273
#define REG_RX_274 0x74 // REG_RX_274
#define REG_RX_275 0x75 // REG_RX_275
#define REG_RX_276 0x76 // REG_RX_276
#define REG_RX_277 0x77 // REG_RX_277
#define REG_RX_278 0x78 // REG_RX_278
#define REG_RX_279 0x79 // REG_RX_279
#define REG_RX_27A 0x7A // REG_RX_27A
#define REG_RX_27B 0x7B // REG_RX_27B
#define REG_RX_27C 0x7C // REG_RX_27C
#define REG_RX_27D 0x7D // REG_RX_27D
#define REG_RX_27E 0x7E // REG_RX_27E
#define REG_RX_27F 0x7F // REG_RX_27F
#define REG_RX_280 0x80 // REG_RX_280
#define REG_RX_281 0x81 // REG_RX_281
#define REG_RX_282 0x82 // REG_RX_282
#define REG_RX_283 0x83 // REG_RX_283
#define REG_RX_284 0x84 // REG_RX_284
#define REG_RX_285 0x85 // REG_RX_285
#define REG_RX_286 0x86 // REG_RX_286
#define REG_RX_287 0x87 // REG_RX_287
#define REG_RX_288 0x88 // REG_RX_288
#define REG_RX_289 0x89 // REG_RX_289
#define REG_RX_28A 0x8A // REG_RX_28A
#define REG_RX_28B 0x8B // REG_RX_28B
#define REG_RX_28C 0x8C // REG_RX_28C
#define REG_RX_28D 0x8D // REG_RX_28D
#define REG_RX_28E 0x8E // REG_RX_28E
#define REG_RX_28F 0x8F // REG_RX_28F
#define REG_RX_290 0x90 // REG_RX_290
#define REG_RX_291 0x91 // REG_RX_291
#define REG_RX_292 0x92 // REG_RX_292
#define REG_RX_293 0x93 // REG_RX_293
#define REG_RX_294 0x94 // REG_RX_294
#define REG_RX_295 0x95 // REG_RX_295
#define REG_RX_296 0x96 // REG_RX_296
#define REG_RX_297 0x97 // REG_RX_297
#define REG_RX_298 0x98 // REG_RX_298
#define REG_RX_299 0x99 // REG_RX_299
#define REG_RX_29A 0x9A // REG_RX_29A
#define REG_RX_29B 0x9B // REG_RX_29B
#define REG_RX_29C 0x9C // REG_RX_29C
#define REG_RX_29D 0x9D // REG_RX_29D
#define REG_RX_29E 0x9E // REG_RX_29E
#define REG_RX_29F 0x9F // REG_RX_29F
#define REG_RX_2A0 0xA0 // REG_RX_2A0
#define REG_RX_2A1 0xA1 // REG_RX_2A1
#define REG_RX_2A2 0xA2 // REG_RX_2A2
#define REG_RX_2A3 0xA3 // REG_RX_2A3
#define REG_RX_2A4 0xA4 // REG_RX_2A4
#define REG_RX_2A5 0xA5 // REG_RX_2A5
#define REG_RX_2A6 0xA6 // REG_RX_2A6
#define REG_RX_2A7 0xA7 // REG_RX_2A7
#define REG_RX_2A8 0xA8 // REG_RX_2A8
#define REG_RX_2A9 0xA9 // REG_RX_2A9
#define REG_RX_2AA 0xAA // REG_RX_2AA
#define REG_RX_2AB 0xAB // REG_RX_2AB
#define REG_RX_2AC 0xAC // REG_RX_2AC
#define REG_RX_2AD 0xAD // REG_RX_2AD
#define REG_RX_2AE 0xAE // REG_RX_2AE
#define REG_RX_2AF 0xAF // REG_RX_2AF
#define REG_RX_2BA 0xBA // REG_RX_2BA
#define REG_RX_2BB 0xBB // REG_RX_2BB
#define REG_RX_2BC 0xBC // REG_RX_2BC
#define REG_RX_2BD 0xBD // REG_RX_2BD
#define REG_RX_2BE 0xBE // REG_RX_2BE
#define REG_RX_2BF 0xBF // REG_RX_2BF
#define REG_RX_2B0 0xB0 // REG_RX_2B0
#define REG_RX_2B1 0xB1 // REG_RX_2B1
#define REG_RX_2B2 0xB2 // REG_RX_2B2
#define REG_RX_2B3 0xB3 // REG_RX_2B3
#define REG_RX_2B4 0xB4 // REG_RX_2B4
#define REG_RX_2B5 0xB5 // REG_RX_2B5
#define REG_RX_2B6 0xB6 // REG_RX_2B6
#define REG_RX_2B7 0xB7 // REG_RX_2B7
#define REG_RX_2B8 0xB8 // REG_RX_2B8
#define REG_RX_2B9 0xB9 // REG_RX_2B9
#define REG_RX_2BA 0xBA // REG_RX_2BA
#define REG_RX_2BB 0xBB // REG_RX_2BB
#define REG_RX_2BC 0xBC // REG_RX_2BC
#define REG_RX_2BD 0xBD // REG_RX_2BD
#define REG_RX_2BE 0xBE // REG_RX_2BE
#define REG_RX_2BF 0xBF // REG_RX_2BF
#define REG_RX_2BA 0xBA // REG_RX_2BA
#define REG_RX_2BB 0xBB // REG_RX_2BB
#define REG_RX_2BC 0xBC // REG_RX_2BC
#define REG_RX_2BD 0xBD // REG_RX_2BD
#define REG_RX_2BE 0xBE // REG_RX_2BE
#define REG_RX_2BF 0xBF // REG_RX_2BF
#define REG_RX_2C0 0xC0 // REG_RX_2C0
#define REG_RX_2C1 0xC1 // REG_RX_2C1
#define REG_RX_2C2 0xC2 // REG_RX_2C2
#define REG_RX_2C3 0xC3 // REG_RX_2C3
#define REG_RX_2C4 0xC4 // REG_RX_2C4
#define REG_RX_2C5 0xC5 // REG_RX_2C5
#define REG_RX_2C6 0xC6 // REG_RX_2C6
#define REG_RX_2C7 0xC7 // REG_RX_2C7
#define REG_RX_2C8 0xC8 // REG_RX_2C8
#define REG_RX_2C9 0xC9 // REG_RX_2C9
#define REG_RX_2CA 0xCA // REG_RX_2CA
#define REG_RX_2CB 0xCB // REG_RX_2CB
#define REG_RX_2CC 0xCC // REG_RX_2CC
#define REG_RX_2CD 0xCD // REG_RX_2CD
#define REG_RX_2CE 0xCE // REG_RX_2CE
#define REG_RX_2CF 0xCF // REG_RX_2CF
#define REG_RX_2CA 0xCA // REG_RX_2CA
#define REG_RX_2CB 0xCB // REG_RX_2CB
#define REG_RX_2CC 0xCC // REG_RX_2CC
#define REG_RX_2CD 0xCD // REG_RX_2CD
#define REG_RX_2CE 0xCE // REG_RX_2CE
#define REG_RX_2CF 0xCF // REG_RX_2CF
#define REG_RX_2D0 0xD0 // REG_RX_2D0
#define REG_RX_2D1 0xD1 // REG_RX_2D1
#define REG_RX_2D2 0xD2 // REG_RX_2D2
#define REG_RX_2D3 0xD3 // REG_RX_2D3
#define REG_RX_2D4 0xD4 // REG_RX_2D4
#define REG_RX_2D5 0xD5 // REG_RX_2D5
#define REG_RX_2D6 0xD6 // REG_RX_2D6
#define REG_RX_2D7 0xD7 // REG_RX_2D7
#define REG_RX_2D8 0xD8 // REG_RX_2D8
#define REG_RX_2D9 0xD9 // REG_RX_2D9
#define REG_RX_2DA 0xDA // REG_RX_2DA
#define REG_RX_2DB 0xDB // REG_RX_2DB
#define REG_RX_2DC 0xDC // REG_RX_2DC
#define REG_RX_2DD 0xDD // REG_RX_2DD
#define REG_RX_2DE 0xDE // REG_RX_2DE
#define REG_RX_2DF 0xDF // REG_RX_2DF
#define REG_RX_2DA 0xDA // REG_RX_2DA
#define REG_RX_2DB 0xDB // REG_RX_2DB
#define REG_RX_2DC 0xDC // REG_RX_2DC
#define REG_RX_2DD 0xDD // REG_RX_2DD
#define REG_RX_2DE 0xDE // REG_RX_2DE
#define REG_RX_2DF 0xDF // REG_RX_2DF
#define REG_RX_2E0 0xE0 // REG_RX_2E0
#define REG_RX_2E1 0xE1 // REG_RX_2E1
#define REG_RX_2E2 0xE2 // REG_RX_2E2
#define REG_RX_2E3 0xE3 // REG_RX_2E3
#define REG_RX_2E4 0xE4 // REG_RX_2E4
#define REG_RX_2E5 0xE5 // REG_RX_2E5
#define REG_RX_2E6 0xE6 // REG_RX_2E6
#define REG_RX_2E7 0xE7 // REG_RX_2E7
#define REG_RX_2E8 0xE8 // REG_RX_2E8
#define REG_RX_2E9 0xE9 // REG_RX_2E9
#define REG_RX_2EA 0xEA // REG_RX_2EA
#define REG_RX_2EB 0xEB // REG_RX_2EB
#define REG_RX_2EC 0xEC // REG_RX_2EC
#define REG_RX_2ED 0xED // REG_RX_2ED
#define REG_RX_2EE 0xEE // REG_RX_2EE
#define REG_RX_2EF 0xEF // REG_RX_2EF
#define REG_RX_2EA 0xEA // REG_RX_2EA
#define REG_RX_2EB 0xEB // REG_RX_2EB
#define REG_RX_2EC 0xEC // REG_RX_2EC
#define REG_RX_2ED 0xED // REG_RX_2ED
#define REG_RX_2EE 0xEE // REG_RX_2EE
#define REG_RX_2EF 0xEF // REG_RX_2EF
#define REG_RX_2F0 0xF0 // REG_RX_2F0
#define REG_RX_2F1 0xF1 // REG_RX_2F1
#define REG_RX_2F2 0xF2 // REG_RX_2F2
#define REG_RX_2F3 0xF3 // REG_RX_2F3
#define REG_RX_2F4 0xF4 // REG_RX_2F4
#define REG_RX_2F5 0xF5 // REG_RX_2F5
#define REG_RX_2F6 0xF6 // REG_RX_2F6
#define REG_RX_2F7 0xF7 // REG_RX_2F7
#define REG_RX_2F8 0xF8 // REG_RX_2F8
#define REG_RX_2F9 0xF9 // REG_RX_2F9
#define REG_RX_2FA 0xFA // REG_RX_2FA
#define REG_RX_2FB 0xFB // REG_RX_2FB
#define REG_RX_2FC 0xFC // REG_RX_2FC
#define REG_RX_2FD 0xFD // REG_RX_2FD
#define REG_RX_2FE 0xFE // REG_RX_2FE
#define REG_RX_2FF 0xFF // REG_RX_2FF
#define REG_RX_2FA 0xFA // REG_RX_2FA
#define REG_RX_2FB 0xFB // REG_RX_2FB
#define REG_RX_2FC 0xFC // REG_RX_2FC
#define REG_RX_2FD 0xFD // REG_RX_2FD
#define REG_RX_2FE 0xFE // REG_RX_2FE
#define REG_RX_2FF 0xFF // REG_RX_2FF

