chengping1970/STM8S207/Mhlrx_reg.h
#define MHL_RX_00 0x00	//MHL_RX_00
#define MHL_RX_01 0x01	//MHL_RX_01
#define MHL_RX_02 0x02	//MHL_RX_02
#define MHL_RX_03 0x03	//MHL_RX_03
#define MHL_RX_04 0x04	//MHL_RX_04
#define MHL_RX_05 0x05	//MHL_RX_05
#define MHL_RX_06 0x06	//MHL_RX_06
#define MHL_RX_07 0x07	//MHL_RX_07
#define MHL_RX_08 0x08	//MHL_RX_08
#define MHL_RX_09 0x09	//MHL_RX_09
#define MHL_RX_0A 0x0A	//MHL_RX_0A
#define MHL_RX_0B 0x0B	//MHL_RX_0B
#define MHL_RX_0C 0x0C	//MHL_RX_0C
#define MHL_RX_0D 0x0D	//MHL_RX_0D
#define MHL_RX_0E 0x0E	//MHL_RX_0E
#define MHL_RX_0F 0x0F	//MHL_RX_0F
#define MHL_RX_10 0x10	//MHL_RX_10
#define MHL_RX_11 0x11	//MHL_RX_11
#define MHL_RX_12 0x12	//MHL_RX_12
#define MHL_RX_13 0x13	//MHL_RX_13
#define MHL_RX_14 0x14	//MHL_RX_14
#define MHL_RX_15 0x15	//MHL_RX_15
#define MHL_RX_16 0x16	//MHL_RX_16
#define MHL_RX_17 0x17	//MHL_RX_17
#define MHL_RX_18 0x18	//MHL_RX_18
#define MHL_RX_19 0x19	//MHL_RX_19
#define MHL_RX_1A 0x1A	//MHL_RX_1A
#define MHL_RX_1B 0x1B	//MHL_RX_1B
#define MHL_RX_1C 0x1C	//MHL_RX_1C
#define MHL_RX_1D 0x1D	//MHL_RX_1D
#define MHL_RX_1E 0x1E	//MHL_RX_1E
#define MHL_RX_1F 0x1F	//MHL_RX_1F
#define MHL_RX_20 0x20	//MHL_RX_20
#define MHL_RX_21 0x21	//MHL_RX_21
#define MHL_RX_22 0x22	//MHL_RX_22
#define MHL_RX_23 0x23	//MHL_RX_23
#define MHL_RX_24 0x24	//MHL_RX_24
#define MHL_RX_25 0x25	//MHL_RX_25
#define MHL_RX_26 0x26	//MHL_RX_26
#define MHL_RX_27 0x27	//MHL_RX_27
#define MHL_RX_28 0x28	//MHL_RX_28
#define MHL_RX_29 0x29	//MHL_RX_29
#define MHL_RX_2A 0x2A	//MHL_RX_2A
#define MHL_RX_2B 0x2B	//MHL_RX_2B
#define MHL_RX_2C 0x2C	//MHL_RX_2C
#define MHL_RX_2D 0x2D	//MHL_RX_2D
#define MHL_RX_2E 0x2E	//MHL_RX_2E
#define MHL_RX_2F 0x2F	//MHL_RX_2F
#define MHL_RX_30 0x30	//MHL_RX_30
#define MHL_RX_31 0x31	//MHL_RX_31
#define MHL_RX_32 0x32	//MHL_RX_32
#define MHL_RX_33 0x33	//MHL_RX_33
#define MHL_RX_34 0x34	//MHL_RX_34
#define MHL_RX_35 0x35	//MHL_RX_35
#define MHL_RX_36 0x36	//MHL_RX_36
#define MHL_RX_37 0x37	//MHL_RX_37
#define MHL_RX_38 0x38	//MHL_RX_38
#define MHL_RX_39 0x39	//MHL_RX_39
#define MHL_RX_3A 0x3A	//MHL_RX_3A
#define MHL_RX_3B 0x3B	//MHL_RX_3B
#define MHL_RX_3C 0x3C	//MHL_RX_3C
#define MHL_RX_3D 0x3D	//MHL_RX_3D
#define MHL_RX_3E 0x3E	//MHL_RX_3E
#define MHL_RX_3F 0x3F	//MHL_RX_3F
#define MHL_RX_40 0x40	//MHL_RX_40
#define MHL_RX_41 0x41	//MHL_RX_41
#define MHL_RX_42 0x42	//MHL_RX_42
#define MHL_RX_43 0x43	//MHL_RX_43
#define MHL_RX_44 0x44	//MHL_RX_44
#define MHL_RX_45 0x45	//MHL_RX_45
#define MHL_RX_46 0x46	//MHL_RX_46
#define MHL_RX_47 0x47	//MHL_RX_47
#define MHL_RX_48 0x48	//MHL_RX_48
#define MHL_RX_49 0x49	//MHL_RX_49
#define MHL_RX_4A 0x4A	//MHL_RX_4A
#define MHL_RX_4B 0x4B	//MHL_RX_4B
#define MHL_RX_4C 0x4C	//MHL_RX_4C
#define MHL_RX_4D 0x4D	//MHL_RX_4D
#define MHL_RX_4E 0x4E	//MHL_RX_4E
#define MHL_RX_4F 0x4F	//MHL_RX_4F
#define MHL_RX_50 0x50	//MHL_RX_50
#define MHL_RX_51 0x51	//MHL_RX_51
#define MHL_RX_52 0x52	//MHL_RX_52
#define MHL_RX_53 0x53	//MHL_RX_53
#define MHL_RX_54 0x54	//MHL_RX_54
#define MHL_RX_55 0x55	//MHL_RX_55
#define MHL_RX_56 0x56	//MHL_RX_56
#define MHL_RX_57 0x57	//MHL_RX_57
#define MHL_RX_58 0x58	//MHL_RX_58
#define MHL_RX_59 0x59	//MHL_RX_59
#define MHL_RX_5A 0x5A	//MHL_RX_5A
#define MHL_RX_5B 0x5B	//MHL_RX_5B
#define MHL_RX_5C 0x5C	//MHL_RX_5C
#define MHL_RX_5D 0x5D	//MHL_RX_5D
#define MHL_RX_5E 0x5E	//MHL_RX_5E
#define MHL_RX_5F 0x5F	//MHL_RX_5F
#define MHL_RX_60 0x60	//MHL_RX_60
#define MHL_RX_61 0x61	//MHL_RX_61
#define MHL_RX_62 0x62	//MHL_RX_62
#define MHL_RX_63 0x63	//MHL_RX_63
#define MHL_RX_64 0x64	//MHL_RX_64
#define MHL_RX_65 0x65	//MHL_RX_65
#define MHL_RX_66 0x66	//MHL_RX_66
#define MHL_RX_67 0x67	//MHL_RX_67
#define MHL_RX_68 0x68	//MHL_RX_68
#define MHL_RX_69 0x69	//MHL_RX_69
#define MHL_RX_6A 0x6A	//MHL_RX_6A
#define MHL_RX_6B 0x6B	//MHL_RX_6B
#define MHL_RX_6C 0x6C	//MHL_RX_6C
#define MHL_RX_6D 0x6D	//MHL_RX_6D
#define MHL_RX_6E 0x6E	//MHL_RX_6E
#define MHL_RX_6F 0x6F	//MHL_RX_6F
#define MHL_RX_70 0x70	//MHL_RX_70
#define MHL_RX_71 0x71	//MHL_RX_71
#define MHL_RX_72 0x72	//MHL_RX_72
#define MHL_RX_73 0x73	//MHL_RX_73
#define MHL_RX_74 0x74	//MHL_RX_74
#define MHL_RX_75 0x75	//MHL_RX_75
#define MHL_RX_76 0x76	//MHL_RX_76
#define MHL_RX_77 0x77	//MHL_RX_77
#define MHL_RX_78 0x78	//MHL_RX_78
#define MHL_RX_79 0x79	//MHL_RX_79
#define MHL_RX_7A 0x7A	//MHL_RX_7A
#define MHL_RX_7B 0x7B	//MHL_RX_7B
#define MHL_RX_7C 0x7C	//MHL_RX_7C
#define MHL_RX_7D 0x7D	//MHL_RX_7D
#define MHL_RX_7E 0x7E	//MHL_RX_7E
#define MHL_RX_7F 0x7F	//MHL_RX_7F
#define MHL_RX_80 0x80	//MHL_RX_80
#define MHL_RX_81 0x81	//MHL_RX_81
#define MHL_RX_82 0x82	//MHL_RX_82
#define MHL_RX_83 0x83	//MHL_RX_83
#define MHL_RX_84 0x84	//MHL_RX_84
#define MHL_RX_85 0x85	//MHL_RX_85
#define MHL_RX_86 0x86	//MHL_RX_86
#define MHL_RX_87 0x87	//MHL_RX_87
#define MHL_RX_88 0x88	//MHL_RX_88
#define MHL_RX_89 0x89	//MHL_RX_89
#define MHL_RX_8A 0x8A	//MHL_RX_8A
#define MHL_RX_8B 0x8B	//MHL_RX_8B
#define MHL_RX_8C 0x8C	//MHL_RX_8C
#define MHL_RX_8D 0x8D	//MHL_RX_8D
#define MHL_RX_8E 0x8E	//MHL_RX_8E
#define MHL_RX_8F 0x8F	//MHL_RX_8F
#define MHL_RX_90 0x90	//MHL_RX_90
#define MHL_RX_91 0x91	//MHL_RX_91
#define MHL_RX_92 0x92	//MHL_RX_92
#define MHL_RX_93 0x93	//MHL_RX_93
#define MHL_RX_94 0x94	//MHL_RX_94
#define MHL_RX_95 0x95	//MHL_RX_95
#define MHL_RX_96 0x96	//MHL_RX_96
#define MHL_RX_97 0x97	//MHL_RX_97
#define MHL_RX_98 0x98	//MHL_RX_98
#define MHL_RX_99 0x99	//MHL_RX_99
#define MHL_RX_9A 0x9A	//MHL_RX_9A
#define MHL_RX_9B 0x9B	//MHL_RX_9B
#define MHL_RX_9C 0x9C	//MHL_RX_9C
#define MHL_RX_9D 0x9D	//MHL_RX_9D
#define MHL_RX_9E 0x9E	//MHL_RX_9E
#define MHL_RX_9F 0x9F	//MHL_RX_9F
#define MHL_RX_A0 0xA0	//MHL_RX_A0
#define MHL_RX_A1 0xA1	//MHL_RX_A1
#define MHL_RX_A2 0xA2	//MHL_RX_A2
#define MHL_RX_A3 0xA3	//MHL_RX_A3
#define MHL_RX_A4 0xA4	//MHL_RX_A4
#define MHL_RX_A5 0xA5	//MHL_RX_A5
#define MHL_RX_A6 0xA6	//MHL_RX_A6
#define MHL_RX_A7 0xA7	//MHL_RX_A7
#define MHL_RX_A8 0xA8	//MHL_RX_A8
#define MHL_RX_A9 0xA9	//MHL_RX_A9
#define MHL_RX_AA 0xAA	//MHL_RX_AA
#define MHL_RX_AB 0xAB	//MHL_RX_AB
#define MHL_RX_AC 0xAC	//MHL_RX_AC
#define MHL_RX_AD 0xAD	//MHL_RX_AD
#define MHL_RX_AE 0xAE	//MHL_RX_AE
#define MHL_RX_AF 0xAF	//MHL_RX_AF
#define MHL_RX_B0 0xB0	//MHL_RX_B0
#define MHL_RX_B1 0xB1	//MHL_RX_B1
#define MHL_RX_B2 0xB2	//MHL_RX_B2
#define MHL_RX_B3 0xB3	//MHL_RX_B3
#define MHL_RX_B4 0xB4	//MHL_RX_B4
#define MHL_RX_B5 0xB5	//MHL_RX_B5
#define MHL_RX_B6 0xB6	//MHL_RX_B6
#define MHL_RX_B7 0xB7	//MHL_RX_B7
#define MHL_RX_B8 0xB8	//MHL_RX_B8
#define MHL_RX_B9 0xB9	//MHL_RX_B9
#define MHL_RX_BA 0xBA	//MHL_RX_BA
#define MHL_RX_BB 0xBB	//MHL_RX_BB
#define MHL_RX_BC 0xBC	//MHL_RX_BC
#define MHL_RX_BD 0xBD	//MHL_RX_BD
#define MHL_RX_BE 0xBE	//MHL_RX_BE
#define MHL_RX_BF 0xBF	//MHL_RX_BF
#define MHL_RX_C0 0xC0	//MHL_RX_C0
#define MHL_RX_C1 0xC1	//MHL_RX_C1
#define MHL_RX_C2 0xC2	//MHL_RX_C2
#define MHL_RX_C3 0xC3	//MHL_RX_C3
#define MHL_RX_C4 0xC4	//MHL_RX_C4
#define MHL_RX_C5 0xC5	//MHL_RX_C5
#define MHL_RX_C6 0xC6	//MHL_RX_C6
#define MHL_RX_C7 0xC7	//MHL_RX_C7
#define MHL_RX_C8 0xC8	//MHL_RX_C8
#define MHL_RX_C9 0xC9	//MHL_RX_C9
#define MHL_RX_CA 0xCA	//MHL_RX_CA
#define MHL_RX_CB 0xCB	//MHL_RX_CB
#define MHL_RX_CC 0xCC	//MHL_RX_CC
#define MHL_RX_CD 0xCD	//MHL_RX_CD
#define MHL_RX_CE 0xCE	//MHL_RX_CE
#define MHL_RX_CF 0xCF	//MHL_RX_CF
#define MHL_RX_D0 0xD0	//MHL_RX_D0
#define MHL_RX_D1 0xD1	//MHL_RX_D1
#define MHL_RX_D2 0xD2	//MHL_RX_D2
#define MHL_RX_D3 0xD3	//MHL_RX_D3
#define MHL_RX_D4 0xD4	//MHL_RX_D4
#define MHL_RX_D5 0xD5	//MHL_RX_D5
#define MHL_RX_D6 0xD6	//MHL_RX_D6
#define MHL_RX_D7 0xD7	//MHL_RX_D7
#define MHL_RX_D8 0xD8	//MHL_RX_D8
#define MHL_RX_D9 0xD9	//MHL_RX_D9
#define MHL_RX_DA 0xDA	//MHL_RX_DA
#define MHL_RX_DB 0xDB	//MHL_RX_DB
#define MHL_RX_DC 0xDC	//MHL_RX_DC
#define MHL_RX_DD 0xDD	//MHL_RX_DD
#define MHL_RX_DE 0xDE	//MHL_RX_DE
#define MHL_RX_DF 0xDF	//MHL_RX_DF
#define MHL_RX_E0 0xE0	//MHL_RX_E0
#define MHL_RX_E1 0xE1	//MHL_RX_E1
#define MHL_RX_E2 0xE2	//MHL_RX_E2
#define MHL_RX_E3 0xE3	//MHL_RX_E3
#define MHL_RX_E4 0xE4	//MHL_RX_E4
#define MHL_RX_E5 0xE5	//MHL_RX_E5
#define MHL_RX_E6 0xE6	//MHL_RX_E6
#define MHL_RX_E7 0xE7	//MHL_RX_E7
#define MHL_RX_E8 0xE8	//MHL_RX_E8
#define MHL_RX_E9 0xE9	//MHL_RX_E9
#define MHL_RX_EA 0xEA	//MHL_RX_EA
#define MHL_RX_EB 0xEB	//MHL_RX_EB
#define MHL_RX_EC 0xEC	//MHL_RX_EC
#define MHL_RX_ED 0xED	//MHL_RX_ED
#define MHL_RX_EE 0xEE	//MHL_RX_EE
#define MHL_RX_EF 0xEF	//MHL_RX_EF
#define MHL_RX_F0 0xF0	//MHL_RX_F0
#define MHL_RX_F1 0xF1	//MHL_RX_F1
#define MHL_RX_F2 0xF2	//MHL_RX_F2
#define MHL_RX_F3 0xF3	//MHL_RX_F3
#define MHL_RX_F4 0xF4	//MHL_RX_F4
#define MHL_RX_F5 0xF5	//MHL_RX_F5
#define MHL_RX_F6 0xF6	//MHL_RX_F6
#define MHL_RX_F7 0xF7	//MHL_RX_F7
#define MHL_RX_F8 0xF8	//MHL_RX_F8
#define MHL_RX_F9 0xF9	//MHL_RX_F9
#define MHL_RX_FA 0xFA	//MHL_RX_FA
#define MHL_RX_FB 0xFB	//MHL_RX_FB
#define MHL_RX_FC 0xFC	//MHL_RX_FC
#define MHL_RX_FD 0xFD	//MHL_RX_FD
#define MHL_RX_FE 0xFE	//MHL_RX_FE
#define MHL_RX_FF 0xFF	//MHL_RX_FF
#endif

#if 1
/*****************************************************************************/
/* Mask Definitions **********************************************************/
/*****************************************************************************/
	#define B_7 0x80 // bit7
	#define B_6 0x40 // bit6
	#define B_5 0x20 // bit5
	#define B_4 0x10 // bit4
	#define B_3 0x08 // bit3
	#define B_2 0x04 // bit2
	#define B_1 0x02 // bit1
	#define B_0 0x01 // bit0


#define REG_RX_P0_SYS_STATUS 0x0A
	#define B_P0_SCDT 0x80 // bit7
	#define B_P0_MHL_MODE 0x40 // bit6
	#define B_P0_IPLL_LOCK 0x20 // bit5
	#define B_P0_RXCK_SPEED 0x10 // bit4
	#define B_P0_RXCK_VALID 0x08 // bit3
	#define B_P0_VCLK_DET 0x04 // bit2
	#define B_P0_HDMI_MODE 0x02 // bit1
	#define B_P0_PWR5V_DET 0x01 // bit0

