chengping1970/STM8S207/Mhlrx_reg.h
	#define O_AVI_SCAN_INFO 0
	#define M_AVI_SCAN_INFO_MASK 3
	#define M_AVI_SCAN_NODATA    0
	#define M_AVI_SCAN_OVER_SCAN 1
	#define M_AVI_SCAN_UNDER_SCAN 2
#define REG_RX_AVI_DB1 0x15 // REG_RX_215
	// D[7:6] C1C0 Colorimetry
	#define O_AVI_CLRMET 6
	#define M_AVI_CLRMET_MASK 3
	#define B_AVI_CLRMET_NODATA 0
	#define B_AVI_CLRMET_ITU601  1
	#define B_AVI_CLRMET_ITU709  2
	#define B_AVI_CLRMET_Extend  3	// _SupportXVYcc_ --> indicated in bits EC0~EC2
	// D[5:4] M1M0 Picture Aspect Ratio
	#define O_AVI_PIC_ASRATIO 4
	#define M_AVI_PIC_ASRATIO_MASK 3
	#define B_AVI_PIC_ASRATIO_NODATA 0
	#define B_AVI_PIC_ASRATIO_4_3    1
	#define B_AVI_PIC_ASRATIO_16_9   2
	// D[3:0] R3R2R1R0 Active Format Aspect Ratio
	#define O_AVI_FMT_ASRATIO 0
	#define M_AVI_FMT_ASRATIO_MASK  0xF
	#define M_AVI_FMT_ASRATIO_EQPIC 0x8
	#define M_AVI_FMT_ASRATIO_4_3 0x9
	#define M_AVI_FMT_ASRATIO_16_9 0xA
	#define M_AVI_FMT_ASRATIO_14_9 0xB
#define REG_RX_AVI_DB2 0x16 // REG_RX_216
	#define O_AVI_NUNI_SCALE 0
	#define M_AVI_NUNI_SCALE_MASK 3
	#define B_AVI_NUNI_SCALE_NODATA 0
	#define B_AVI_NUNI_SCALE_HORZ 1
	#define B_AVI_NUNI_SCALE_VERT 2
	#define B_AVI_NUNI_SCALE_HORZVERT 3
#define REG_RX_AVI_DB3 0x17 // REG_RX_217
	#define O_AVI_VIDCODE 0
	#define O_AVI_VIDCODE_MASK 0x7f
#define REG_RX_AVI_DB4 0x18 // REG_RX_218
	#define O_AVI_PIXREPT 0
	#define M_AVI_PIXREPT_MASK 0xF
#define REG_RX_AVI_DB5 0x19 // REG_RX_219
#define REG_RX_AVI_DB6 0x1A // REG_RX_21A
#define REG_RX_AVI_DB7 0x1B // REG_RX_21B
#define REG_RX_AVI_DB8 0x1C // REG_RX_21C
#define REG_RX_AVI_DB9 0x1D // REG_RX_21D
#define REG_RX_AVI_DB10 0x1E // REG_RX_21E
#define REG_RX_AVI_DB11 0x1F // REG_RX_21F
#define REG_RX_AVI_DB12 0x20 // REG_RX_220
#define REG_RX_AVI_DB13 0x21 // REG_RX_221
#define REG_RX_AVI_DB14 0x22 // REG_RX_222
#define REG_RX_AVI_DB15 0x23 // REG_RX_223

#endif


#endif
